{
  "backend/main.mo": "Stores user records keyed by principal and provides registration, login timestamp updates, and lookup helpers.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme OKLCH color tokens and applying global background and text classes.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for landing, launcher, and tile pages and renders the router provider.",
  "frontend/src/app/tiles.ts": "Defines metadata for 8 launcher tiles including id, name, description, and route.",
  "frontend/src/components/AuthGate.tsx": "Redirects authenticated users to the launcher and shows the landing page otherwise.",
  "frontend/src/components/DisclaimerBanner.tsx": "UI alert banner warning that the app is an unaffiliated demo.",
  "frontend/src/components/SignedInHeader.tsx": "Header showing the user principal and a sign‑out button that clears query cache and identity.",
  "frontend/src/hooks/useActor.ts": "React Query hook that constructs a backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuthRefresh.ts": "Handles user registration after login and clears cache on logout based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity loading, and related status management.",
  "frontend/src/index.css": "Defines Tailwind layers and custom OKLCH theme variables for light/dark modes and applies global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Implements the sign‑in screen with email input, Internet Identity login trigger, error handling, and themed layout.",
  "frontend/src/pages/LauncherPage.tsx": "Shows the post‑login app launcher with search, user record display, tile grid navigation, and auth guard.",
  "frontend/src/pages/TilePlaceholderPage.tsx": "Renders placeholder pages for individual tiles with auth guarding and simple descriptive content.",
  "frontend/src/queries/userQueries.ts": "Provides React Query hooks for fetching user records, registration, and registration status via the backend actor.",
  "frontend/src/queryClient.ts": "Configures a shared React Query client with default staleTime and retry behavior.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens using OKLCH variables and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing requirements, features, images, and current build state for the Live.com‑style app."
}